Revit 2026 API

# StructuralAssetBehavior Property

---

Flag indicating whether elements of this material behave isotropically or orthotropically.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public StructuralBehavior Behavior { get; set; }
```
```vb
Public Property Behavior As StructuralBehavior
	Get
	Set
```
```cpp
public:
property StructuralBehavior Behavior {
	StructuralBehavior get ();
	void set (StructuralBehavior value);
}
```
```fsharp
member Behavior : StructuralBehavior with get, set
```

#### Property Value

StructuralBehavior

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

Applies to concrete, Metal, and generic structural assets. If the behavior is set to Isotropic, then the y and z components of Young modulus, Poisson modulus, shear modulus and thermal expansion coefficient will be changed to the value the same as their x components.

#### Reference

StructuralAsset Class

Autodesk.Revit.DB Namespace